WessonYan/HDMCU_HONESTAR/HC32F_M14_SDK/HC32F_M14_SDK/驱动库及样例/HC32F_M14X_DDL_V1.0/HC32F_M14X_DDL/mcu/EWARM/HDSC_HC32F_M14X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CTIOSEL03</name>
            <description>desc CTIOSEL03</description>
            <baseAddress>0x40025100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTSEL0123</name>
                    <description>desc CTSEL0123</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>SEL01</name>
                            <description>desc SEL01</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL23</name>
                            <description>desc SEL23</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CTSSSR</name>
            <description>desc CTSSSR</description>
            <baseAddress>0x40025F00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFD</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTSSSR</name>
                    <description>desc CTSSSR</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SSSR0</name>
                            <description>desc SSSR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR1</name>
                            <description>desc SSSR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR2</name>
                            <description>desc SSSR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR3</name>
                            <description>desc SSSR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR4</name>
                            <description>desc SSSR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR5</name>
                            <description>desc SSSR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR6</name>
                            <description>desc SSSR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSSR7</name>
                            <description>desc SSSR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CT0_PPG</name>
            <description>desc CT_PPG</description>
            <baseAddress>0x40025000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x12</size>
            </addressBlock>
            <registers>
                <register>
                    <name>LWRR</name>
                    <description>desc LWRR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>HWRR</name>
                    <description>desc HWRR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>TCNT</name>
                    <description>desc TCNT</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>TCR</name>
                    <description>desc TCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F7F</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENCNT</name>
                            <description>desc ENCNT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODS</name>
                            <description>desc MODS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLRT</name>
                            <description>desc PLRT</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FUNC</name>
                            <description>desc FUNC</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDGS</name>
                            <description>desc EDGS</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MASK</name>
                            <description>desc MASK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSTEN</name>
                            <description>desc RSTEN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKS</name>
                            <description>desc CLKS</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STA</name>
                    <description>desc STA</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x55</resetMask>
                    <fields>
                        <field>
                            <name>UDFIR</name>
                            <description>desc UDFIR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGIR</name>
                            <description>desc TRGIR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFIE</name>
                            <description>desc UDFIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGIE</name>
                            <description>desc TRGIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCR2</name>
                    <description>desc TCR2</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>CLKS3</name>
                            <description>desc CLKS3</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
