WessonYan/HDMCU_HONESTAR/HC32F_M14_SDK/HC32F_M14_SDK/驱动库及样例/HC32F_M14X_DDL_V1.0/HC32F_M14X_DDL/mcu/EWARM/HDSC_HC32F_M14X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DTIM1</name>
            <description>desc DTIM</description>
            <baseAddress>0x40015000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
            <registers>
                <register>
                    <name>TIMERLOAD</name>
                    <description>desc TIMERLOAD</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TIMERVALUE</name>
                    <description>desc TIMERVALUE</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TIMERCTRL</name>
                    <description>desc TIMERCTRL</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x20</resetValue>
                    <resetMask>0xEF</resetMask>
                    <fields>
                        <field>
                            <name>ONESHOT</name>
                            <description>desc ONESHOT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRSIZE</name>
                            <description>desc TMRSIZE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRPRE</name>
                            <description>desc TMRPRE</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTEN</name>
                            <description>desc INTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRMODE</name>
                            <description>desc TMRMODE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMREN</name>
                            <description>desc TMREN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERINTCLR</name>
                    <description>desc TIMERINTCLR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TIMERRIS</name>
                    <description>desc TIMERRIS</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TMRINTST</name>
                            <description>desc TMRINTST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERMIS</name>
                    <description>desc TIMERMIS</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TMRMINTST</name>
                            <description>desc TMRMINTST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERBGLOAD</name>
                    <description>desc TIMERBGLOAD</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="DTIM1">
            <name>DTIM2</name>
            <description>desc DTIM</description>
            <baseAddress>0x40015020</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>EXTINT</name>
            <description>desc EXTINT</description>
            <baseAddress>0x40030000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A</size>
            </addressBlock>
            <registers>
                <register>
                    <name>INTEN</name>
                    <description>desc INTEN</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN0</name>
                            <description>desc EN0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN1</name>
                            <description>desc EN1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN2</name>
                            <description>desc EN2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN3</name>
                            <description>desc EN3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN4</name>
                            <description>desc EN4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN5</name>
                            <description>desc EN5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN6</name>
                            <description>desc EN6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN7</name>
                            <description>desc EN7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN8</name>
                            <description>desc EN8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN9</name>
                            <description>desc EN9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN10</name>
                            <description>desc EN10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN11</name>
                            <description>desc EN11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN12</name>
                            <description>desc EN12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN13</name>
                            <description>desc EN13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN14</name>
                            <description>desc EN14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN15</name>
                            <description>desc EN15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTSRC</name>
                    <description>desc INTSRC</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SRC0</name>
                            <description>desc SRC0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC1</name>
                            <description>desc SRC1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC2</name>
                            <description>desc SRC2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC3</name>
                            <description>desc SRC3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC4</name>
                            <description>desc SRC4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC5</name>
                            <description>desc SRC5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC6</name>
                            <description>desc SRC6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC7</name>
                            <description>desc SRC7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC8</name>
                            <description>desc SRC8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC9</name>
                            <description>desc SRC9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC10</name>
                            <description>desc SRC10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC11</name>
                            <description>desc SRC11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC12</name>
                            <description>desc SRC12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC13</name>
                            <description>desc SRC13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC14</name>
                            <description>desc SRC14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRC15</name>
                            <description>desc SRC15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCLR</name>
                    <description>desc INTCLR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLR0</name>
                            <description>desc CLR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR1</name>
                            <description>desc CLR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR2</name>
                            <description>desc CLR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR3</name>
                            <description>desc CLR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR4</name>
                            <description>desc CLR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR5</name>
                            <description>desc CLR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR6</name>
                            <description>desc CLR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR7</name>
                            <description>desc CLR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR8</name>
                            <description>desc CLR8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR9</name>
                            <description>desc CLR9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR10</name>
                            <description>desc CLR10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR11</name>
                            <description>desc CLR11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR12</name>
                            <description>desc CLR12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR13</name>
                            <description>desc CLR13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR14</name>
                            <description>desc CLR14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLR15</name>
                            <description>desc CLR15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
