WessonYan/HDMCU_HONESTAR/HC32F_M14_SDK/HC32F_M14_SDK/驱动库及样例/HC32F_M14X_DDL_V1.0/HC32F_M14X_DDL/mcu/EWARM/HDSC_HC32F_M14X.svd
                <register>
                    <name>IRQ19PEND</name>
                    <description>desc IRQ19PEND</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11</resetMask>
                    <fields>
                        <field>
                            <name>MSC6INT</name>
                            <description>desc MSC6INT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMA0INT</name>
                            <description>desc DMA0INT</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ20PEND</name>
                    <description>desc IRQ20PEND</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11</resetMask>
                    <fields>
                        <field>
                            <name>MSC6INT</name>
                            <description>desc MSC6INT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMA1INT</name>
                            <description>desc DMA1INT</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ24PEND</name>
                    <description>desc IRQ24PEND</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD7</resetMask>
                    <fields>
                        <field>
                            <name>MOSCI</name>
                            <description>desc MOSCI</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOSCI</name>
                            <description>desc SOSCI</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MPLLI</name>
                            <description>desc MPLLI</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WCI</name>
                            <description>desc WCI</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSWKUP</name>
                            <description>desc MSWKUP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RAMI</name>
                            <description>desc RAMI</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ25PEND</name>
                    <description>desc IRQ25PEND</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>ADCI</name>
                            <description>desc ADCI</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ26PEND</name>
                    <description>desc IRQ26PEND</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x20</resetMask>
                    <fields>
                        <field>
                            <name>VCI</name>
                            <description>desc VCI</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ28PEND</name>
                    <description>desc IRQ28PEND</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9</resetMask>
                    <fields>
                        <field>
                            <name>TPI</name>
                            <description>desc TPI</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TZI</name>
                            <description>desc TZI</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ30PEND</name>
                    <description>desc IRQ30PEND</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>OCMPU0</name>
                            <description>desc OCMPU0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OCMPU1</name>
                            <description>desc OCMPU1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OCMPU2</name>
                            <description>desc OCMPU2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OCMPU3</name>
                            <description>desc OCMPU3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OCMPU4</name>
                            <description>desc OCMPU4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OCMPU5</name>
                            <description>desc OCMPU5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ31PEND</name>
                    <description>desc IRQ31PEND</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80000FF</resetMask>
                    <fields>
                        <field>
                            <name>CTI0IRQ</name>
                            <description>desc CTI0IRQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI1IRQ</name>
                            <description>desc CTI1IRQ</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI2IRQ</name>
                            <description>desc CTI2IRQ</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI3IRQ</name>
                            <description>desc CTI3IRQ</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI4IRQ</name>
                            <description>desc CTI4IRQ</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI5IRQ</name>
                            <description>desc CTI5IRQ</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI6IRQ</name>
                            <description>desc CTI6IRQ</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTI7IRQ</name>
                            <description>desc CTI7IRQ</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLASHI</name>
                            <description>desc FLASHI</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
