WessonYan/HDMCU_HONESTAR/HC32F_M14_SDK/HC32F_M14_SDK/驱动库及样例/HC32F_M14X_DDL_V1.0/HC32F_M14X_DDL/mcu/EWARM/HDSC_HC32F_M14X.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="MSC4_SPI">
            <name>MSC5_SPI</name>
            <description>desc MSC_SPI</description>
            <baseAddress>0x40037100</baseAddress>
            <alternatePeripheral>MSC5_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x52</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="MSC4_SPI">
            <name>MSC6_SPI</name>
            <description>desc MSC_SPI</description>
            <baseAddress>0x40037200</baseAddress>
            <alternatePeripheral>MSC6_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x52</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>MSC4_UART</name>
            <description>desc MSC_UART</description>
            <baseAddress>0x40037000</baseAddress>
            <alternatePeripheral>MSC4_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x52</size>
            </addressBlock>
            <registers>
                <register>
                    <name>MR</name>
                    <description>desc MR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xED</resetMask>
                    <fields>
                        <field>
                            <name>DOE</name>
                            <description>desc DOE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDS</name>
                            <description>desc TDS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBLS</name>
                            <description>desc SBLS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9F</resetMask>
                    <fields>
                        <field>
                            <name>TXE</name>
                            <description>desc TXE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXE</name>
                            <description>desc RXE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBIE</name>
                            <description>desc TBIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXIE</name>
                            <description>desc TXIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXIE</name>
                            <description>desc RXIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCL</name>
                            <description>desc PCL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECR</name>
                    <description>desc ECR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DL</name>
                            <description>desc DL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>desc PS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>desc PE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>desc INV</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ESBLS</name>
                            <description>desc ESBLS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCEB</name>
                            <description>desc FCEB</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0xBF</resetMask>
                    <fields>
                        <field>
                            <name>TBIF</name>
                            <description>desc TBIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TDEF</name>
                            <description>desc TDEF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDFF</name>
                            <description>desc RDFF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ORF</name>
                            <description>desc ORF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEF</name>
                            <description>desc FEF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PEF</name>
                            <description>desc PEF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RECLR</name>
                            <description>desc RECLR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDR</name>
                    <description>desc RXDR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF</resetMask>
                </register>
                <register>
                    <name>TXDR</name>
                    <description>desc TXDR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                </register>
                <register>
                    <name>BRS</name>
                    <description>desc BRS</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BRS</name>
                            <description>desc BRS</description>
                            <msb>14</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXT</name>
                            <description>desc EXT</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP</name>
                    <description>desc COMP</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x83FF</resetMask>
                    <fields>
                        <field>
                            <name>COMP</name>
                            <description>desc COMP</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CE</name>
                            <description>desc CE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
